https://www.dicoding.com/academies/184/tutorials/8334?from=8330
- Belajar menggunakan library Pandas.
- Pandas memiliki fungsi untuk mengubah data dari berbagai jenis menjadi dataframe. 
- Tahapan dalam mengubah data menjadi dataframe adalah sebagai berikut:
 1. Persiapkan dataset yang akan dikonversi.
 2. Impor library Pandas.
 3. Gunakan fungsi read_csv() untuk mengonversi data.

In [ ]:
import os
os.listdir('sample_data')

['anscombe.json',
 'README.md',
 'mnist_test.csv',
 'mnist_train_small.csv',
 'california_housing_train.csv',
 'california_housing_test.csv']

In [ ]:
import pandas as pd
df = pd.read_json('sample_data/anscombe.json')
df.head()

  Series   X     Y
0      I  10  8.04
1      I   8  6.95
2      I  13  7.58
3      I   9  8.81
4      I  11  8.33

In [ ]:
import pandas as pd
df = pd.read_csv('sample_data/california_housing_train.csv')
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]